//Задача 1:
//Создать программу для имитации работы клиники. Пусть в клинике будет три врача:

//хирург, терапевт и дантист. Каждый врач имеет метод «лечить», но каждый врач лечит по-своему.

// У терапевта создать метод, который будет назначать врача пациенту согласно плану лечения:

//Если план лечения имеет код 1 – назначить хирурга и выполнить метод лечить.
//Если план лечения имеет код 2 – назначить дантиста и выполнить метод лечить.
//Если план лечения имеет любой другой код – назначить терапевта и выполнить метод лечить.

public class Clinic {


}
