
//Задача 1:
//Создать классы "Директор", "Рабочий", "Бухгалтер". Реализовать интерфейс с методом,
//который печатает название должности и имплементировать этот метод в созданные
//классы.


//Задача 2:
//Написать иерархию классов Фигура, Треугольник, Прямоугольник, Круг. Реализовать
//функцию подсчета площади для каждого типа фигуры и подсчет периметра(используя абстрактный класс/методы).
// Создать массив из 5 разных фигур. Вывести на экран сумму периметра всех фигур в массиве.

//Задача *:
//Самостоятельно изучить и показать пример работы интерфейса-маркера Cloneable.

import task1.*;

public class Main {
    public static void main(String[] args) {
        showInterfaceExample();
    }

    public static void showInterfaceExample() {
        Person[] people = new Person[]{
                new Director("Archil"),
                new Accountant("Elena"),
                new Worker("Alexander")
        };
        for (Person person : people){
            person.showRole();
            person.doSomeWork();
            System.out.println("--------------------------------------------------------");
        }
    }

}
