/*
Задача 1:
Создать класс для описания пользователя системы. Переопределить в классе методы
toString, hashcode и equals. Создать несколько экземпляров класса с одним и тем же
значением полей и сравнить с помощью метода equals.

Задача *:
Создать программу для реализации поверхностного и глубокого клонирования объекта класса User.
Пусть на вход программе будет передаваться тип операции клонирования (поверхностное клонирование или глубокое),
а также id юзера для клонирования.
        */

public class Main {
    public static void main(String[] args) {

    }
}
